&НаКлиенте
Перем MH2,MH4,TC;
&НаСервере
Перем M;
&НаСервереБезКонтекста
Функция O(С,Ф="",К=0)
	З=?(Ф="","`",""); П=СтрЗаменить(?(Ф="",С,Ф)," ",""); Попытка Выполнить("З="+?(Ф="","Метаданные"+?(С="","","."+П),П)); Исключение КонецПопытки; Возврат ?(К=0,З,З.ПолноеИмя());	
КонецФункции
&НаСервере
Функция НажатиеСервер(Н)
	Если (Н="П")или(Н="С") Тогда ТД=Новый ТабличныйДокумент; Если Н="С" Тогда О=РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет").ПолучитьОбласть("Я"); ТД.Вывести(О); Иначе РеквизитФормыВЗначение("Объект").Печать(РеквизитФормыВЗначение("Д3"),ТД); КонецЕсли; Возврат ТД; 
	Иначе Д=РеквизитФормыВЗначение(Д1); Д.Строки.Сортировать(?(Элементы[Лев(Н,1)+2].Пометка,"К6","К5"),Истина); ЗначениеВРеквизитФормы(Д,Д1); 
	КонецЕсли; 
КонецФункции
&НаКлиенте
Процедура Нажатие(К)
	Н=К.Имя; Ч=Число(Прав(Н,1)); Т=Лев(Н,1);
	Если (Т="П")или(Т="С") Тогда ТД=НажатиеСервер(Т); ТД.ОтображатьСетку=Ложь; ТД.Показать();
	ИначеЕсли Т="Ф" Тогда ПриАктивизацииСтрокиСервер(Собрать(?(Ч=1,Истина,Ложь)),Элементы[?(Ч=1,"Д1","Д3")].ТекущиеДанные.ПолучитьИдентификатор(),?(Ч=1,"Д2","Д4"));
	ИначеЕсли Т="В" Тогда Видимость(0);
	ИначеЕсли (Т="Р")или(Т="Н") Тогда Д=?(Т="Н",Д5,Д6); М=Д.ПолучитьЭлементы(); К=?(Т="Н",5,6); Для Каждого П Из М Цикл Если Ч=1 Тогда Элементы["Д"+К].Свернуть(П.ПолучитьИдентификатор()); Иначе Элементы["Д"+К].Развернуть(П.ПолучитьИдентификатор(),Истина); КонецЕсли; КонецЦикла;
	Иначе Д=?(Т="К","Д1","Д3"); Ф=?(Т="К",Ф1,Ф2);
		Если (Ч>3)и(СтрДлина(Ф)>1) Тогда Возврат; КонецЕсли; 
		Если Ч=1 Тогда НажатиеСервер(Н);
		ИначеЕсли Ч=6 Тогда Элементы[Н].Пометка=?(Элементы[Н].Пометка=Ложь,Истина,Ложь);
		Иначе
			Если Элементы[Н].Пометка=Ложь Тогда Элементы[Т+?(Ч=2,3,?(Ч=3,2,?(Ч=4,5,4)))].Пометка=Ложь; Элементы[Н].Пометка=Истина; Если (Ч=2)или(Ч=3) Тогда Элементы[Д+(Ч-1)].Видимость=Ложь; Элементы[Д+?(Ч=2,2,1)].Видимость=Истина; КонецЕсли; Иначе Возврат; КонецЕсли;
		КонецЕсли; 
		Если Ч>3 Тогда ПриАктивизацииСтрокиСервер(Собрать(?(Т="К",Истина,Ложь)),Элементы[Д].ТекущиеДанные.ПолучитьИдентификатор(),?(Т="К","Д2","Д4")); КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ДопСервер(Р,З,Н,К=0)
	Если Н="Режим" Тогда Д=?(Строка(Метаданные.РежимИспользованияМодальности)="НеИспользовать",Ложь,Истина);
	ИначеЕсли Н="Расписание" Тогда М=РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные",O(Р))); К=М.Количество(); Если К>1 Тогда СП=Новый СписокЗначений; СП.ЗагрузитьЗначения(М); Х=СП.ВыбратьЭлемент(); Д=?(Х=Неопределено,З[0],Х.Значение); Иначе Д=М[0]; КонецЕсли;
	ИначеЕсли Н="Открыть список" Тогда O(,Р).ПолучитьФормуСписка().Открыть(); Д=Истина;
	ИначеЕсли Н="Карта маршрута" Тогда Д=O(,Р).ПолучитьКартуМаршрута();
	Иначе Если К=20 Тогда Д=ПолучитьОбщийМакет(O(Р)); Иначе Т=СтрЗаменить(Р,".",Символы.ПС); В=СтрПолучитьСтроку(Т,СтрЧислоСтрок(Т)); Д=O(,СтрЗаменить(Р,".Макеты."+В,"")+".ПолучитьМакет("""+В+""")"); КонецЕсли; 
	КонецЕсли; Возврат ?(Н="Расписание",Д.Расписание,Д);
КонецФункции
&НаСервере
Процедура ВыборЗначенияСервер(Э,С,Н)
	M=ПолучитьИзВременногоХранилища(A); З=?(Э="Д5",Д5,?(Э="Д2",Д2,Д4)); С2=З.НайтиПоИдентификатору(С); T=?(M[10]=0,Истина,Ложь);  
	Если Э="Д5" Тогда M[9]=С2.К9; ПоместитьВоВременноеХранилище(M,A);; Видимость(3); ОткрытьДругие(1); 
	Иначе M[?(T,6,8)]=С2; ПоместитьВоВременноеХранилище(M,A);;
		Если (Н="Стандартные реквизиты")или(Н="Стандартные табличные части")или(Н="Пакет")или(Н="WS-ссылка")или(Н="Права")или(Н="Структура хранения") Тогда
			Д=РеквизитФормыВЗначение("Д3"); Видимость(1); РеквизитФормыВЗначение("Объект").ОткрытьПрочие(Д,A); ЗначениеВРеквизитФормы(Д,"Д3"); Элементы.Д40.Видимость=?(Н="Права",Истина,Ложь); Элементы.Д42.Видимость=?(Н="Права",Ложь,Истина); Элементы.Д46.Видимость=?((Н="Пакет")или(Н="WS-ссылка"),Истина,Ложь); Элементы.П0.Доступность=?(Н="Структура хранения",Истина,Ложь);
		Иначе	
			Видимость(?(Лев(Н,3)="Тип",3,2)); ОткрытьДругие(0);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ВыборЗначения(Э,С,П,Б)
	Если Э.Имя="Д1" Тогда
		#Если ТолстыйКлиентУправляемоеПриложение Тогда
			Т=Э.ТекущиеДанные; К=Т.Р1; Если ((К=8)или(К=30)или(К=33)или(К=35)или((К>37)и(К<47)))и(СтрЧислоВхождений(Т.К3,".")=1)и(ФС) Тогда ДополнительноСервер(Т.К3,"","Открыть список"); Б=Ложь; КонецЕсли; 
		#КонецЕсли
	Иначе С1=?(Э.Имя="Д2",Элементы.Д1.ТекущиеДанные,Элементы.Д3.ТекущиеДанные); С2=Э.ТекущиеДанные;
		Если (Прав(П.Имя,1)="5")и(С2.Р2>0) Тогда Н=С2.К1; З=С2.К3; Р=С1.К3;
			Если Н="Справочная информация" Тогда О=ОткрытьСправку(?(Р="","Конфигурация",O(Р,,1))); Если О=Ложь Тогда Сообщить("Справка отсутствует"); КонецЕсли; 
			ИначеЕсли Н="Карта маршрута" Тогда Д=ДопСервер(Р,З,Н); Д.Показать();
			ИначеЕсли З="Значение" Тогда Д=O(Р+"."+З); ОткрытьЗначение(Д);
			ИначеЕсли Н="Картинка" Тогда Если С1.Р1=21 Тогда Д=БиблиотекаКартинок[СтрЗаменить(Р,"ОбщиеКартинки.","")]; Иначе Д=O(Р+"."+З); КонецЕсли; ОткрытьЗначение(Д); 
			ИначеЕсли Н="Макет" Тогда М=ДопСервер(С1.К3,С2.К3,Н,С1.К4);	Если (ТипЗнч(М)=Тип("ТабличныйДокумент"))или(ТипЗнч(М)=Тип("ТекстовыйДокумент")) Тогда М.ТолькоПросмотр=Истина; М.Показать(Р); КонецЕсли; 
			ИначеЕсли Н="Открыть список" Тогда ДопСервер(Р,З,Н);
			ИначеЕсли Н="Расписание" Тогда Ф=Новый ДиалогРасписанияРегламентногоЗадания(ДопСервер(С1.К3,С2.К3,Н)); Если ДопСервер("","","Режим") Тогда Ф.ОткрытьМодально(); Иначе Попытка Ф.Показать(); Исключение КонецПопытки; КонецЕсли; 
			Иначе
				Если Найти(НРег(З),"форма")>0 Тогда Попытка ОткрытьФорму(З); Исключение Сообщить("Форма открывается с дополнительными параметрами"); КонецПопытки;
				Иначе Х=?((Н="Стандартные реквизиты")или(Н="Стандартные табличные части")или(Н="Пакет")или(Н="WS-ссылка")или(Н="Права")или(Н="Структура хранения"),Ложь,Истина); ВыборЗначенияСервер(Э.Имя,С,Н);
					Если Х Тогда К=Лев(Н,3); Д=?(К="Тип",Д6,Д5); М=Д.ПолучитьЭлементы(); Для Каждого П Из М Цикл Элементы["Д"+?(К="Тип",6,5)].Развернуть(П.ПолучитьИдентификатор(),Истина); КонецЦикла; 
					Иначе Если (Н<>"Права")и(Н<>"Структура хранения") Тогда М=Д3.ПолучитьЭлементы(); Для Каждого П Из М Цикл Элементы.Д3.Развернуть(П.ПолучитьИдентификатор()); КонецЦикла; КонецЕсли; 
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Прав(П.Имя,2)="58" Тогда ВыборЗначенияСервер(Э.Имя,С,"Тип"); Для Каждого П Из Д6.ПолучитьЭлементы() Цикл Элементы.Д6.Развернуть(П.ПолучитьИдентификатор(),Истина); КонецЦикла; 
		ИначеЕсли (Прав(П.Имя,1)="1")и(С2.Р1>0) Тогда К=С2.Р1; С2.Р1=?(К=1,2,1); Р=С2.К1; О=Ложь; MH=?(Э.Имя="Д2",MH2,MH4); 
			Если К=1 Тогда Э.ТекущиеДанные.ПолучитьЭлементы().Очистить(); MH.Добавить(Р); Иначе MH.Удалить(MH.Найти(Р)); ПриАктивизацииСтрокиСервер(Собрать(?(Э.Имя="Д2",Истина,Ложь)),С1.ПолучитьИдентификатор(),Э.Имя); КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
&НаКлиенте
Функция Собрать(Н)
	Ф=Новый Массив(7); Ф[0]=?(Н,Ф1,Ф2); Ф[1]=?(Н,MH2,MH4); Ф[5]=Н; Ф[6]=Истина; Для А=4 По 6 Цикл Ф[А-2]=Элементы[?(Н,"К","Т")+А].Пометка; КонецЦикла; Возврат Ф;
КонецФункции
&НаСервере
Процедура ПриАктивизацииСтрокиСервер(Ф,С,Н)
	M=ПолучитьИзВременногоХранилища(A); Т=?((Н="Д1")или(Н="Д2"),Истина,Ложь); З=?(Т,Д1,Д3); Р=З.НайтиПоИдентификатору(С); Если (Р<>?(Т,M[5],M[7]))или(Н="Д2")или(Н="Д4") Тогда Д=РеквизитФормыВЗначение(?(Т,"Д2","Д4")); M[?(Т,5,7)]=Р; ПоместитьВоВременноеХранилище(M,A); РеквизитФормыВЗначение("Объект").Подготовка(Д,Ф,A); ЗначениеВРеквизитФормы(Д,?(Т,"Д2","Д4")); КонецЕсли; 
КонецПроцедуры
&НаКлиенте
Процедура ПриАктивизацииСтроки(Э)
	Д=Э.ТекущиеДанные; T=?(Э.Имя="Д1",Истина,Ложь); Если Д<>Неопределено Тогда Если TC[?(T,0,1)]<>Д.К3 Тогда TC[?(T,0,1)]=Д.К3; ПриАктивизацииСтрокиСервер(Собрать(T),Д.ПолучитьИдентификатор(),Э.Имя); КонецЕсли; КонецЕсли; 
КонецПроцедуры
&НаСервере
Процедура Видимость(Ф)
	M=ПолучитьИзВременногоХранилища(A); Ф=?(ТипЗнч(Ф)=Тип("Число"),Ф,0); П=M[11]; Т=M[10]; Ф=?((Ф=0)и(П>0)и(П<>3),П,Ф); Э1=?(П=1,M[7],M[5]); Э2=?(П=1,M[8],M[6]);
	З=?(Ф=0,"",?(П=0,M[0].Найти(Э1.К4,"К1").К2,"Стандартные реквизиты")); M[10]=Ф; M[11]=?((Ф>1)и(Т>0),Т,0); ЭтаФорма.Заголовок=?(Ф=0,"Метаданные конфигурации """+Метаданные.Синоним+"""",З+" - "+Э1.К1+" - "+Э2.К1);
	Элементы.О1.Видимость=?(Ф=0,Истина,Ложь); Элементы.О2.Видимость=?(Ф=1,Истина,Ложь); Элементы.О3.Видимость=?(Ф=2,Истина,Ложь); Элементы.О4.Видимость=?(Ф=3,Истина,Ложь);
	Если Ф=0 Тогда M[6]=Неопределено; M[7]=Неопределено; M[8]=Неопределено; КонецЕсли; ПоместитьВоВременноеХранилище(M,A);
КонецПроцедуры
&НаСервере
Процедура ПередРазворачиваниемСервер(Н,З)
	Д=?(З="Д1",Д1,Д3); С=Д.НайтиПоИдентификатору(Н); Э=С.ПолучитьЭлементы(); РеквизитФормыВЗначение("Объект").ПроверитьНаличие(С,A);
КонецПроцедуры
&НаКлиенте
Процедура ПередРазворачиванием(Э,С,Б)
	T=?(Э.Имя="Д1",Истина,Ложь); Д=?(T,Д1,Д3); З=Д.НайтиПоИдентификатору(С); П=З.ПолучитьЭлементы(); Если П.Количество()=1 Тогда Если П[0].К1="Х" Тогда П.Удалить(0); ПередРазворачиваниемСервер(С,Э.Имя); КонецЕсли; КонецЕсли; 
КонецПроцедуры
&НаСервере
Процедура ОткрытьДругие(Ф)
	M=ПолучитьИзВременногоХранилища(A); У=M[11]; Э1=?(У=1,M[7],M[5]); Э2=?(У=1,M[8],M[6]); Н=Э2.К1; К=Э1.Р1; 
	Если (Лев(Н,3)="Тип")или(Ф=1) Тогда В=1; Т6=РеквизитФормыВЗначение("Д6"); Т6.Строки.Очистить(); РеквизитФормыВЗначение("Объект").ЗаполнитьТипы(В,Ф,Т6,A); ЗначениеВРеквизитФормы(Т6,"Д6"); 
	Иначе Т5=РеквизитФормыВЗначение("Д5"); Т5.Строки.Очистить();
		Если (Н="Ввод по строке")или(Н="Поля блокировки данных")или(Н="Поля ключа")или(Н="Назначения использования") Тогда В=20;
		ИначеЕсли (Н="Подсистемы") Тогда В=21;
		ИначеЕсли (Н="Предопределенные")или(Н="Характеристики")или(Найти(Н,"выбора")>0) Тогда В=?(M[6].К1="Характеристики",9,?(К=39,5,?(К=30,6,?(К=38,7,?(К=40,8,?(Лев(M[6].К1,1)="С",10,11))))));  
		Иначе В=?(К=7,3,?((К=8)или(Н="Обмен данными"),4,2));
		КонецЕсли; 
		Для А=1 По 27 Цикл
			Если ((А=1)и(((В>1)и(В<5))или(В=20)или(В=21)))или((А=2)и(В=4))или((А>2)и(А<5)и(В=3))или((А=5)и(В>4)и(В<20)и(В<>9))или((А>5)и(А<8)и(В>4)и(В<9))или((А=8)и(В=7))или((А>8)и(А<17)и(В=5))или((А>16)и(А<25)и(В=9))или((А=25)и(В=11))или((А>25)и(В=10)) Тогда
				Элементы["Д5"+А].Видимость=Истина; 
			Иначе	
				Элементы["Д5"+А].Видимость=Ложь; 
			КонецЕсли; 
		КонецЦикла;
		Элементы.Д50.Видимость=?((В=3)или(В=4),Истина,Ложь); Если (В>4)и(В<20) Тогда РеквизитФормыВЗначение("Объект").ЗаполнитьПрочие(В,Т5,A); Иначе РеквизитФормыВЗначение("Объект").ЗаполнитьТипы(В,Ф,Т5,A); КонецЕсли;
		Если Н<>"Подсистемы" Тогда Т5.Строки.Сортировать("Р1"); КонецЕсли; ЗначениеВРеквизитФормы(Т5,"Д5"); Элементы.Д5.ГоризонтальныеЛинии=?((В>4)и(В<21),Истина,Ложь); Элементы.Д5.ВертикальныеЛинии=?((В>4)и(В<21),Истина,Ложь); 
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(О,Б)
	Для А=1 По 6 Цикл Элементы[?(А<4,"К","Т")+?((А=1)или(А=4),4,?((А=3)или(А=6),2,6))].Пометка=Ложь; КонецЦикла; Д=РеквизитФормыВЗначение("Д1"); M=РеквизитФормыВЗначение("Объект").ЗаполнитьНачало(Д); A=ПоместитьВоВременноеХранилище(M,ЭтаФорма.УникальныйИдентификатор); ЗначениеВРеквизитФормы(Д,"Д1"); Видимость(0);
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Элементы.ФС.Видимость=Истина;
	#КонецЕсли	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(О)
	MH2=Новый Массив; MH4=Новый Массив; TC=Новый Массив(2); 
КонецПроцедуры

&НаСервере
Процедура ДополнительноСервер(К3,П1,П2)
КонецПроцедуры








