
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "РазличияВТаблицах" и Источник = "Помощники" Тогда
		ОтобразитьСверочнуюТаблицу(Параметр);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	ДокументРезультат.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьСверочнуюТаблицу(СверочнаяТаблицаХранилище)
	НомерСтрокиТД = ДокументРезультат.ВысотаТаблицы+1;
	Область = ДокументРезультат.Область(НомерСтрокиТД, 2);
	Область.Текст = ТекущаяДата();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ОбработкаОбъект.СформироватьТабличныйДокументПоТаблицеРазличий(СверочнаяТаблицаХранилище.Получить());
	ДокументРезультат.Вывести(ТабличныйДокумент);
	
	НомерСтрокиТД = ДокументРезультат.ВысотаТаблицы+2;
	Область = ДокументРезультат.Область(НомерСтрокиТД, 1);
	Область.Текст = "";
КонецПроцедуры

#КонецОбласти
