
Функция КаталогТекущейОбраотки() 
	Файл = Новый Файл(ЭтотОбъект.ИспользуемоеИмяФайла);
	Возврат Файл.Путь;
КонецФункции

Процедура ОткрытьМодальноФорму(ВидОбъекта, Параметр) Экспорт
	
	Если НЕ нрег(ВидОбъекта) = нрег(ОткрытьФормуМодально) Тогда
		Возврат;
	КонецЕсли;
	
	Выполнить("ОткрытьМодально_" + ВидОбъекта+ "(Параметр)");
	
КонецПроцедуры

Процедура ОткрытьМодально_ОткрытьФормуОбъекта(Объект) Экспорт
	Форма = Объект.ПолучитьФорму();
	Если Форма = Неопределено Тогда
		ИмяОбработки = Объект.Метаданные().Имя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяОбработки) Тогда
		Форма = Обработки[ИмяОбработки].ПолучитьФорму();
		ЗначениеВДанныеФормы(Объект, Форма.Объект);
	КонецЕсли;
	
	Форма.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(ИмяОбработки) Тогда
		НовыйОбъект = ДанныеФормыВЗначение(Форма.Объект, Тип("ОбработкаОбъект."+ИмяОбработки));
		
		ЗаполнитьЗначенияСвойств(Объект, НовыйОбъект);
		
		Для каждого ТабличнаяЧасть из Объект.Метаданные().ТабличныеЧасти Цикл
			ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
			Объект[ИмяТабличнойЧасти].Загрузить(НовыйОбъект[ИмяТабличнойЧасти].Выгрузить());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьМодально_ПоказатьПеременныеТеста(Параметр) Экспорт
	ФайлФормыПросмотра = КаталогТекущейОбраотки() + "Просмотр переменных теста.epf";
	ОбъектОбработки = ВнешниеОбработки.Создать(ФайлФормыПросмотра, Ложь);
	ОбъектОбработки.Инициализировать(Параметр);
	ОбъектОбработки.ПолучитьФорму().ОткрытьМодально();
КонецПроцедуры

Процедура ОткрытьМодально_ОткрытьКонсольЗапросов(Запрос) Экспорт 
	ФайлКонсоли = КаталогТекущейОбраотки() + "Консоль запросов.epf";
	КонсольЗапросов = ВнешниеОбработки.Создать(ФайлКонсоли, Ложь);
	ФайлПараметров = КаталогВременныхФайлов() + "Результат.sel";
	Если Найти(ТипЗнч(Запрос), "Внешний отчет объект:") = 1 ИЛИ Найти(ТипЗнч(Запрос), "Отчет объект:") = 1 Тогда
		КонсольЗапросов.СохранитьЗапросыИзСКДВФайл(Запрос, ФайлПараметров);
	Иначе
		КонсольЗапросов.СохранитьЗапросВФайл(Запрос, ФайлПараметров);
	КонецЕсли;
	СохранитьЗначение("КонсольЗапросов_ИмяФайла", ФайлПараметров);
	КонсольЗапросов.ПолучитьФорму().ОткрытьМодально();
КонецПроцедуры

