

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПустаяСтрока(Объект.ТабличныйДокументСтрокой) Тогда
		ЗаполнитьТабличныйДокументИзШаблона();
	Иначе
		Попытка
			ТабличныйДокумент.Вывести(ЗначениеИзСтрокиВнутр(Объект.ТабличныйДокументСтрокой));
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументПриИзменении(Элемент)
	Объект.ТабличныйДокументСтрокой = ЗначениеВСтрокуВнутр(ТабличныйДокумент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	ЗаполнитьТабличныйДокументИзШаблона();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстЗапроса(Команда)
	ТекстЗапроса = СформироватьТекстЗапросаНаСервере(ТабличныйДокумент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабличныйДокументИзШаблона()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(ОбработкаОбъект.ПолучитьМакет("Шаблон"));
КонецПроцедуры

&НаСервере
Функция СформироватьТекстЗапросаНаСервере(Макет)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.СформироватьТекстЗапросаПоМакету(Макет);
КонецФункции

#КонецОбласти

