Перем M Экспорт;
Перем PP Экспорт;
Функция H(С,Т=0) Экспорт
	Возврат ?(Т=0,?(M[(С+?(С<2,10,8))]=1,M[?(С<2,7,8)],M[?(С<2,5,6)]),?(Т<4,M[0].Найти(С,"К"+Т),?(Т=10,M[2].Найти(С,"К2"),M[1].Найти(С,"К"+(Т-3)))))
КонецФункции
Функция O(С,Ф="") Экспорт
	З=?(Ф="","`",""); П=T(?(Ф="",С,Ф)); Попытка Выполнить("З="+?(Ф="","Метаданные"+?(С="","","."+П),П)); Исключение КонецПопытки; Возврат З;	
КонецФункции
Функция T(С,О="",Н=0) Экспорт
	Если О="" Тогда З=СтрЗаменить(С," ","");
	Иначе Т=СтрЗаменить(С,О,Символы.ПС);	
		Если Н=0 Тогда
			З=Новый Массив; Для А=1 По СтрЧислоСтрок(Т) Цикл З.Добавить(СтрПолучитьСтроку(Т,А)); КонецЦикла; Если О=" " Тогда Для каждого П Из З Цикл О=О+ВРег(Лев(П,1))+Прав(П,СтрДлина(П)-1); КонецЦикла; З=СтрЗаменить(О," ",""); КонецЕсли; 
		Иначе
			З=СтрПолучитьСтроку(Т,Н);
		КонецЕсли; 
	КонецЕсли; Возврат З;
КонецФункции	
Функция P(О)
	Т=ТипЗнч(О);
	Если Т=Тип("Тип") Тогда З=Метаданные.НайтиПоТипу(О); З=?(З=Неопределено,О,З);
	ИначеЕсли (Т=Тип("ЭлементСоставаПланаОбмена"))или(Т=Тип("ЭлементСоставаОбщегоРеквизита")) Тогда З=О.Метаданные;
	ИначеЕсли Т=Тип("ЭлементСоставаФункциональнойОпции") Тогда З=О.Объект;
	ИначеЕсли Т=Тип("СвязьПоТипу") Тогда З=О.ПутьКДанным;
	ИначеЕсли Т=Тип("ОписаниеТипов") Тогда З=О.Типы();
	Иначе З=О;
	КонецЕсли; Возврат З;
КонецФункции
Функция M(О)
	С=P(О); Т=ТипЗнч(С);
	Если Т=Тип("ОбъектМетаданных") Тогда З=С.ПолноеИмя();
	ИначеЕсли (ТИпЗнч(О)=Тип("ОписаниеСтандартногоРеквизита"))или(ТипЗнч(О)=Тип("ОписаниеСтандартнойТабличнойЧасти")) Тогда З=О.Имя;
	ИначеЕсли Т=Тип("СвязьПараметраВыбора") Тогда З=С.Имя+"("+С.ПутьКДанным+")";
	ИначеЕсли Т=Тип("ПараметрВыбора") Тогда З=С.Имя+"("+С.Значение+")";
	Иначе З=О;
	КонецЕсли; Возврат З;
КонецФункции
Функция СТ(К)
	Т=Новый ТаблицаЗначений; Для А=1 По К Цикл Т.Колонки.Добавить("К"+А); КонецЦикла; Возврат Т;	
КонецФункции
Функция B(С,Ф)
	М=ПолучитьМакет("Макет"); Возврат М.ПолучитьОбласть(С,Ф,С,Ф).ТекущаяОбласть.Текст;
КонецФункции
Функция МЗ(С,Ф)
	М=Новый Массив; Р=M[5].К3; З=O(Р); Н=Лев(С,3); Если Н="Пра" Тогда Д=T(B(M[5].Р1+3,1),"|",1); КонецЕсли; 
	Если Н="Под" Тогда Д=M[12].Скопировать(); С0=Д.Строки[0]; ОтобратьПодсистемы(С0,З,1); М=?(Ф=0,С0.Строки.Количество(),С0);  
	Иначе	
		Для Каждого П Из Метаданные[?(Н="Пра","Роли",?(Н="Обм","ПланыОбмена",?(Н="Жур","ЖурналыДокументов",T(С))))] Цикл
			Если Н="Пра" Тогда О=ПравоДоступа(Д,З,П); Иначе	О=?(Н="Пос",П.Документы,?(Н="Жур",П.РегистрируемыеДокументы,П.Состав)).Содержит(З); КонецЕсли; Если О Тогда М.Добавить(П); Если Ф=0 Тогда Прервать; КонецЕсли; КонецЕсли;	
		КонецЦикла; 
	КонецЕсли; Возврат М;	
КонецФункции
Функция НаличиеРаздела(С,А)
	З=0; Э=M[10];
	Если ((А=48)и(С=68))или((А=51)и(С=35)и(Э=0))или((А=52)и(С=46))или((А=59)и(С=34)и(Э=0))или((А=60)и(С=44))или((А=61)и((С=48)или(С=67)))или((А=65)и(С=23)и(Э=0))или((А=66)и(С=24)и(Э=0)) Тогда З=1;
	ИначеЕсли (А=49)и(((С>40)и(С<45))или(С=32)или(С=60)или(С=68)) Тогда З=1;
	ИначеЕсли (А=50)и(((С>40)и(С<45))или(С=68)) Тогда З=1;
	ИначеЕсли (А=53)и(((С=8)или(С=30)или(С=33)или(С=56))или((С>35)и(С<47))) Тогда З=1;
	ИначеЕсли (((А=54)или(А=55))и(С=39))или((А>66)и(А<70)и(С=47)) Тогда З=1;
	ИначеЕсли (А=56)и(((С=8)или(С=30)или(С=33)или(С=45)или(С=46))или((С>35)и(С<41))) Тогда З=1;
	ИначеЕсли (А=57)и(((С=8)или(С=30))или((С<>36)и(С<>37)и(С>32)и(С<47))) Тогда З=1;
	ИначеЕсли (А=58)и((С=39)или(С=40)) Тогда З=1;
	ИначеЕсли (А=62)и(Э=0)и(((С=8)или(С=9)или(С=15)или(С=30)или(С=48)или(С=67)или(С=68))или((С>32)и(С<47))) Тогда З=1;
	ИначеЕсли (А=63)и(((С=8)или(С=9)или(С=30)или(С=48)или(С=67)или(С=68))или((С>32)и(С<47))) Тогда З=1;
	ИначеЕсли (А=64)и(Э=0)и(((С=8)или(С=15)или(С=30)или(С=48)или(С=67)или(С=68))или((С>32)и(С<47))) Тогда З=1;
	КонецЕсли; Возврат ?(З=0,Ложь,Истина);	
КонецФункции
Процедура НаличиеСписков(С,З,Д)
	Э=H(0); ТС=С.Родитель; Т=?((Д="Предопределенные")или(Д="Хранение"),Д,ТипЗнч(З));  К=Э.Р1; Р=Э.К3;					
	Если (Т=Тип("ОбъектМетаданных"))или((Д="Форма")и((К=16)или(К=62))) Тогда
		Если Найти(НРег(Д),"форма")>0 Тогда Если З=Неопределено Тогда З=O(Р); КонецЕсли;
			Если Лев(ТекущийРежимЗапуска(),1)="О" Тогда Попытка Ф=?(К=16,ПолучитьОбщуюФорму(З),ПолучитьФорму(З.ПолноеИмя())); С.Р2=1; С.К3=З.ПолноеИмя(); С.К2=?((К=16)или(К=62),"Открыть",С.К2); С.К5=С.К2; Исключение КонецПопытки;
			Иначе Т=Лев(Строка(З.ТипФормы),1);
				Если Т="У" Тогда С.Р2=1; С.К3=З.ПолноеИмя(); С.К2=?((К=16)или(К=62),"Открыть",С.К2); С.К5=С.К2;
				Иначе
					#Если ТолстыйКлиентУправляемоеПриложение Тогда
						Если Метаданные.ИспользоватьОбычныеФормыВУправляемомПриложении Тогда С.Р2=1; С.К3=З.ПолноеИмя(); С.К2=?((К=16)или(К=62),"Открыть",С.К2); С.К5=С.К2; КонецЕсли; 
					#КонецЕсли
				КонецЕсли; 
			КонецЕсли; 
		Иначе С.Р2=1; С.К3=?(Д="Задача",Д,T(С.К1)); С.К5=С.К2;
		КонецЕсли;
	ИначеЕсли Д="Стандартные табличные части" Тогда С.Р2=1; С.К3=Д; С.К2="Открыть"; С.К5=С.К2;
	ИначеЕсли Д="Макет" Тогда П=O(Р); М=?(К=20,ПолучитьОбщийМакет(П),ПолучитьМакет(П)); Если (ТипЗнч(М)=Тип("ТабличныйДокумент"))или(ТипЗнч(М)=Тип("ТекстовыйДокумент")) Тогда С.Р2=1; С.К3=Д; С.К2="Открыть"; С.К5=С.К2; КонецЕсли; 
	ИначеЕсли (Д="Поля блокировки данных")или(Д="Ввод по строке")или(Д="Стандартные реквизиты") Тогда П=O(Р+"."+Д); К=П.Количество(); Если К>0 Тогда С.Р2=1; С.К3=Д; С.К2=?(К=1,?(Д="Стандартные реквизиты",П[0].Имя,П),"Открыть"); С.К5=С.К2; Иначе С.К2=""; КонецЕсли; 
	ИначеЕсли Д="Интерфейс" Тогда Если Лев(ТекущийРежимЗапуска(),1)="О" Тогда С.Р2=1; С.К3=Д; С.К2="Переключить"; С.К5=С.К2; КонецЕсли;	
	ИначеЕсли (Д="Пакет")или(Д="Карта маршрута") Тогда С.Р2=1; С.К3=Д; С.К2="Открыть"; С.К5=С.К2;
	ИначеЕсли Д="Расписание" Тогда Если РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные",O(Р))).Количество()>0 Тогда С.Р2=1; С.К3=Д; С.К2="Открыть"; С.К5=С.К2; КонецЕсли; 
	ИначеЕсли Д="Картинка" Тогда Если К<>21 Тогда П=O(Р+"."+Д); Если Строка(П.Вид)="Пустая" Тогда С.К2=""; Возврат;	КонецЕсли; КонецЕсли; С.Р2=1; С.К3=Д; С.К2="Открыть"; С.К5=С.К2;
	ИначеЕсли (Д="Значение")и(К=26) Тогда Если ТипЗнч(З)=Тип("Рамка") Тогда С.К2=З.ТипРамки; Иначе С.Р2=1; С.К3=Д; С.К5=С.К2; КонецЕсли;
	Иначе Н=H(Строка(Т),2);
		Если Н<>Неопределено Тогда Ф=Н.К1;
			Если (Ф=57)или(Ф=58) Тогда С.К2="Открыть"; С.Р2=1; С.К3=Д; С.К5=С.К2;
			ИначеЕсли Ф>71 Тогда 
				Если Ф=92 Тогда К=O(Р+".ПолучитьИменаПредопределенных().Количество()"); Если К<>"`" Тогда Если К>0 Тогда С.К2="Открыть"; С.Р2=1; С.К3="ПолучитьИменаПредопределенных()"; С.К5=С.К2; КонецЕсли; КонецЕсли; 
				ИначеЕсли Ф=94 Тогда С.К2=З.ПолноеИмя(); С.Р2=1; С.К3=Д; С.К5=С.К2;
				Иначе З=?(Т=Тип("ОписаниеТипов"),З.Типы(),З); К=З.Количество();
					Если К=0 Тогда С.К2=""; Иначе С.К3=Д; С.Р2=1; Если К=1 Тогда Для каждого П Из З Цикл О=M(П); С.К2=?(С.К1="Тип",СтрЗаменить(О,".","Ссылка."),О); С.К5=С.К2; КонецЦикла; КонецЕсли; Если ((К>1)и(Ф<>93))или(Ф=87)или(Ф=89)или(Ф=90)или(Э.Р1=8) Тогда С.К2="Открыть"; С.К5=С.К2; КонецЕсли; КонецЕсли;
					Если С.К1="Тип" Тогда Т=?(С.К2="Число",1,?(С.К2="Строка",2,?(С.К2="Дата",3,0)));
						Если Т>0 Тогда Ш=Р+"."+Д+".Квалификаторы"+?(Т=1,"Числа",?(Т=2,"Строки","Даты"))+"."; С2=ТС.Строки.Добавить(); С2.К1=?(Т=3,"Состав даты","Длина"); С2.К2=O(Ш+?(Т=3,"ЧастиДаты",?(Т=1,"Разрядность","Длина"))); Л=С2.К2;
							Если Т<3 Тогда С2=ТС.Строки.Добавить(); С2.К1=?(Т=1,"Точность","Допустимая длина"); С2.К2=O(Ш+?(Т=1,"РазрядностьДробнойЧасти","ДопустимаяДлина"));	
								Если Т=2 Тогда С2=ТС.Строки.Добавить(); С2.К1="Неограниченая длина"; С2.К2=?(Л="0",Истина,Ложь);
								Иначе С2=ТС.Строки.Добавить(); С2.К1="Неотрицательное"; С2.К2=O(Ш+"ДопустимыйЗнак");	С2.К2=?(С2.К2="Неотрицательный",Истина,Ложь); С2.К4=?(С2.К2="Да",Истина,Ложь);
								КонецЕсли; 
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ПроходитПоТипу(С,К)
	Э=H(0); Р=Э.К3; Г=Э.К4; З=Ложь; Д=Э.Р1;
	Если (К<>3)и((С="Режим пароля")или(С="Маска")или(С="Многострочный режим")или(С="Расширенное редактирование")) Тогда З=Истина; КонецЕсли;	
	Если (К<>2)и((С="Выделять отрицательные")или(С="Минимальное значение")или(С="Максимальное значение")) Тогда З=Истина; КонецЕсли;	
	Если (К<>2)и(К<>4)и(К<>5)и((С="Формат")или(С="Формат редактирования")) Тогда З=Истина; КонецЕсли;	
	Если (К<>1)и(К<>18)и(К<>21)и(К<>33)и(К<>35)и(С="Выбор групп и элементов") Тогда З=Истина; КонецЕсли;		
	Если (К<7)и((С="Связи параметров выбора")или(С="Параметры выбора")или(С="Форма выбора")) Тогда З=Истина; 
	ИначеЕсли (С="Заполнять из данных заполнения")или(С="Значение заполнения") Тогда Н=Найти(Р,".ТабличныеЧасти."); Х=?((Г=36)или(Г=37)или((Г>41)и(Г<45))или((Г=47)и((Д=49)или(Д=50))),0,1); Если ((Х=0)и(Н=0))или((Х=1)и(Н>0)) Тогда З=Истина; КонецЕсли;
	ИначеЕсли ((С="Балансовый")или(С="Признак учета")или(С="Признак учета субконто"))и(Г<>43) Тогда З=Истина;
	ИначеЕсли (С="Связь по типу")и(Г=47)и(Д=50) Тогда З=Истина;
	КонецЕсли; 
	Если ((С="Проверка заполнения")или(С="Создание при вводе")или(С="История выбора при вводе"))и(Г=47)и(Д=50) Тогда З=Истина; КонецЕсли; 
	Возврат З;	
КонецФункции
Функция ОтсутствиеРаздела(С)
	Э=H(0); З=Ложь;  Г=Э.К4; К=Э.Р1; Если (С="Использование:")и(((К=53)и((Г=36)или(Г=37)))или((К=56)и(Г<>30)и(Г<>38))или(((К=49)или(К=50))и(Г=47))) Тогда З=Истина; ИначеЕсли (С="Данные:")и(((К=49)и(Г>40)и(Г<44))или((Г=47)и(К=49))или((К=53)и(Г<>44))или((К=50)и(Г>40)и(Г<45))) Тогда З=Истина; КонецЕсли; Возврат З;
КонецФункции
Функция ОтсутствиеЗначения(С)
	Э=H(0); З=Ложь; К=Э.Р1; Р=Э.К3; Г=Э.К4; 
	Если С="Использование" Тогда Если (Г<>30)и(Г<>38)и(Г<>11)и(Г<>13) Тогда З=Истина; Иначе Если (Найти(Р,".ТабличныеЧасти.")>0)и(К=53) Тогда З=Истина; КонецЕсли; КонецЕсли;
	ИначеЕсли С="Индексировать" Тогда Если (Найти(Р,".Ресурсы.")>0)и(Г<>41) Тогда З=Истина; КонецЕсли;
	ИначеЕсли ((С="Ведущее")или(С="Основной отбор"))и(Г<>41) Тогда З=Истина;
	ИначеЕсли (С="Использование в итогах")и(Г<>42) Тогда З=Истина;
	ИначеЕсли (С="Запрет незаполненных значений")и(Г=47)и(К=49) Тогда З=Истина;
	ИначеЕсли (С="Назначения использования")и((К=62)или(К=16)) Тогда П=O(Р); Если Строка(П.ТипФормы)="Обычная" Тогда З=Истина; КонецЕсли;
	КонецЕсли; Возврат З;
КонецФункции
Функция Периодичность(С)
	Если С="Неопределено" Тогда С="";
	ИначеЕсли (С="День")или(С="Месяц")или(С="Год")или(С="Секунда")или(С="Квартал") Тогда С="В пределах "+?(С="День","дня",?(С="Секунда","секунды",НРег(С)+"а"));
	ИначеЕсли С="ПозицияРегистратора" Тогда С="По позиции регистратора";
	КонецЕсли; Возврат С;	
КонецФункции
Функция НайтиПоФильтру(С,Ф)
	З=Ложь; Если Найти(НРег(С),НРег(Ф))=0 Тогда	З=Истина; КонецЕсли; Возврат З;
КонецФункции
Функция Галка(Н,З)
	Если Н="Форма" Тогда В=?(З="Элемент",0,1);
	ИначеЕсли Найти(Н,"кол")>0 Тогда В=?(З="1",0,1);
	ИначеЕсли Н="Упорядоченный" Тогда В=?((З="Да")или(З="Истина"),0,1);
	ИначеЕсли (Н="По умолчанию")или(Н="Локальное имя") Тогда В=?(З="",0,1);
	Иначе В=?((З="Нет")или(З="Ложь"),0,1);
	КонецЕсли; Возврат В;
КонецФункции
Процедура ЗаполнитьД2(ДР,С,K)
	Э=H(0); ФД=K[0]; MH=K[1]; П1=K[2]; П2=K[3]; П3=K[4]; T=K[6]; К=Э.Р1; Ь=?(СтрДлина(ФД)>1,Истина,Ложь);
	Ж="`_                                                                                                                                                                                       _";
	Если К>82 Тогда Для Каждого П Из Э.К7 Цикл С1=ДР.Строки.Добавить(); С1.К1=П.Представление; С1.К2=П.Значение; КонецЦикла;	
	ИначеЕсли (С="Пакет")или(С="WS-ссылка") Тогда
		Если П3=0 Тогда
			Если (Э.К1<>"Модель данных")и(Э.К1<>"Web-сервисы") Тогда 
				Если П2 и (Ь=Ложь) Тогда С1=ДР.Строки.Добавить(); С1.Р1=1; С1.К1="Другие:"; С1=ДР.Строки.Добавить(); С1.К1=Ж; С1.К2=Ж; Иначе С1=ДР; КонецЕсли;
				Если (К=25)или(К=22)или(К=72) Тогда З=?(К=25,"Описание определения Web-сервисов",?(К=22,"URI пространства имен","Пространство имен"));
					Если Ь Тогда Если НайтиПоФильтру(З,ФД)=Ложь Тогда С2=С1.Строки.Добавить(); С2.К1=З; С2.К2=?(К=25,O(,Э.К3),?(К=22,Э.К2,Э.К1)); С2.К5=С2.К2; С2[?(T,"К6","Р2")]=1; КонецЕсли;
					Иначе С2=С1.Строки.Добавить(); С2.К1=З; С2.К2=?(К=25,O(,Э.К3),?(К=22,Э.К2,Э.К1)); С2.К5=С2.К2; С2[?(T,"К6","Р2")]=1; 
					КонецЕсли; 
				Иначе М=T(B(К+3,2),";"); Ф=?((К=23)или(К=65)или(К=70)или(К=78)или(К>79),Истина,Ложь); П=?((К=73)или(К=74),O(,"M[4]."+Э.К3),"");
					Для В=0 По М.Количество()-1 Цикл
						Д=T(М[В],"~"); Н=Д[0]; З=Д[Д.Количество()-1]; Если Ь Тогда Если НайтиПоФильтру(Н,ФД) Тогда Продолжить; КонецЕсли; КонецЕсли; С2=С1.Строки.Добавить(); С2.К1=Н; Р=?(Э.К3="","",Э.К3+".")+З; 
						Если К=74 Тогда
							Если В<5 Тогда Если В=2 Тогда С2.К2="Атомарный"; Иначе С2.К2=П[T(З)]; КонецЕсли; С2[?(T,"К6","Р2")]=?(С2.К2="",0,1);  // ??? не знаю как получить ВариантXDTO
							Иначе Если П.Фасеты<>Неопределено Тогда Х=П.Фасеты.Получить(ВидФасетаXDTO[З]); Если ТипЗнч(Х)=Тип("ФасетXDTO") Тогда С2.К2=Х.Значение; С2[?(T,"К6","Р2")]=1; КонецЕсли; КонецЕсли; 
							КонецЕсли;
						ИначеЕсли К=73 Тогда Д=П[T(З)]; С2.К2=?(Н="Локальное имя","",?(ТипЗнч(Д)=Тип("Булево"),?(Д=Ложь,"Ложь","Истина"),Д)); Если (Н="Имя")или(Н="Ссылка") Тогда Если П.Тип.Имя="" Тогда С2.К2=?(Н="Имя","",П.Имя+" ("+П.URIПространстваИмен+")"); КонецЕсли; КонецЕсли; С2[?(T,"К6","Р2")]=?(С2.К2="",0,?(В<3,1,Галка(С2.К1,С2.К2)));
						Иначе Если Ф Тогда П=O(,Р); Иначе Выполнить("П=M[4]"+"."+T(Р)); КонецЕсли; С2.К2=?(ТипЗнч(П)=Тип("Булево"),?(П=Ложь,"Ложь","Истина"),П); С2[?(T,"К6","Р2")]=?(С2.К2="",0,?(В<2,1,Галка(С2.К1,С2.К2)));
						КонецЕсли;
						Если ((Лев(Н,3)="Тип")или(Н="Базовый тип"))и(С2.К2<>"") Тогда
							Если Н="Базовый тип" Тогда Если П.БазовыйТип=Неопределено Тогда С2.К2=""; С2[?(T,"К6","Р2")]=0; Иначе С2.К2=П.БазовыйТип.Имя+" ("+П.БазовыйТип.URIПространстваИмен+")"; С2[?(T,"К6","Р2")]=1; КонецЕсли;
							Иначе С2.К2=П.Имя+" ("+П.URIПространстваИмен+")"; С2[?(T,"К6","Р2")]=1;
							КонецЕсли; 
						КонецЕсли;
						Если (С2.К2="")и(К=74)и((Найти(З,"Длина")>0)или(В>12)) Тогда С2.К2=0; КонецЕсли; 
					КонецЦикла; 							         
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли С="Права" Тогда Ф=?(M[5].Р1=6,Ложь,Истина); С=?((К=57)или(К=58),Истина,Ложь); Р=?(Ф,O(Э.К3),O(M[5].К3)); М=?(Ф,M[5].К3,Э.К3); 
		Если С Тогда Б=T(М,"."); М=Б[0]+"."+Б[1]; Т=Б[3]+?((К=58)и(Б.Количество()=5),"."+Б[5],""); КонецЕсли; О=O(М);
		Для Каждого П Из ?((К=1)или(Ф),Э.К7,?(T,Э.ПолучитьРодителя().К7,Э.Родитель.К7)) Цикл
			Д=T(П,"~"); Н=Д[0]; З=T(Д[Д.Количество()-1]); Если Ь Тогда Если НайтиПоФильтру(Н,ФД) Тогда Продолжить; КонецЕсли; КонецЕсли; Попытка Г=ПравоДоступа(З,О,Р,?(С,Т,Неопределено)); НС=ДР.Строки.Добавить(); НС.К1=Н; НС[?(T,"К0","К2")]=Г; Исключение П=""; КонецПопытки; 
		КонецЦикла; 
	Иначе ТО=Новый Массив; ТС=ДР; Р=Э.К3; Г=Э.К4; О=O(Э.К3);
		Для А=2 По 6 Цикл
			С=B(К+3,А); Если (А>2)и(С="") Тогда Прервать; КонецЕсли; М=T(С,";");
			Для В=0 По М.Количество()-1 Цикл
				Ч=?((В=0)и(М[В]=""),2,Число(Прав(М[В],1))); Д=T(Лев(М[В],СтрДлина(М[В])-1),"~"); Н=Д[0]; З=Д[Д.Количество()-1];
				Если В=0 Тогда Если (П3)и(Ч=0) Тогда Прервать; КонецЕсли; 
					Если Прав(Н,1)=":" Тогда
						Если ОтсутствиеРаздела(Н) Тогда Прервать; КонецЕсли; Если (MH.Найти(Н)<>Неопределено)и(П2)и(Ь=Ложь)и(T) Тогда ТС=ДР.Строки.Добавить(); ТС.К1=?(А=2,"Основные:",З); ТС.Р1=2; Прервать; КонецЕсли; 
					КонецЕсли; 
					Если П2 и (Ь=Ложь) Тогда ТС=ДР.Строки.Добавить(); ТС.К1=?(А=2,"Основные:",З); ТС.Р1=1; С2=ТС.Строки.Добавить(); С2.К1=Ж; С2.К2=Ж; КонецЕсли;
					Если А=2 Тогда
						Для Х=1 По 3 Цикл
							Если (Х=1)и((К=57)или(К=58)) Тогда Продолжить; КонецЕсли; Б=?(Х=1,"Имя",?(Х=2,"Синоним","Комментарий")); Если Ь Тогда Если НайтиПоФильтру(Б,ФД) Тогда Продолжить; КонецЕсли; КонецЕсли; С2=ТС.Строки.Добавить(); С2.К1=Б; С2.К2=О[Б]; 
						КонецЦикла; 
					КонецЕсли;
				КонецЕсли;
				Если ((В=0)и(А>2))или(З="") Тогда Продолжить; КонецЕсли; 
				Если ((Г=32)и(З="Ведущее"))или((Г=44)и(Найти(Р,".Перерасчеты.")>0)и(З="Тип")) Тогда
					Если П2 и (Ь=Ложь) Тогда Если Г=44 Тогда ТС=ДР.Строки.Добавить(); ТС.К1="Связь:"; ТС.Р1=1; КонецЕсли; С2=ТС.Строки.Добавить(); С2.К1=Ж;  С2.К2=Ж; КонецЕсли; 
					Для Х=1 По 2 Цикл
						Б=?(Х=1,?(Г=44,"Измерение регистра","Соответствие реквизитам документов"),?(Г=44,"Данные ведущих регистров","Соответствие реквизитам движений")); Если Ь Тогда Если НайтиПоФильтру(Б,ФД) Тогда Продолжить; КонецЕсли; КонецЕсли;
						С2=?((П1)или(Ь),ДР.Строки.Добавить(),ТС.Строки.Добавить()); С2.К1=Б; С2.Р2=1; С2.К3=?(Г=44,T(Б," "),?(Х=1,"СоответствиеДокументам","СоответствиеДвижениям")); П=О[С2.К3]; С2.К2=?((Х=1)и(Г=44),П,?(П.Количество()=0,"","Открыть")); С2.К5=С2.К2;
					КонецЦикла; Прервать;
				Иначе
					Если ((Ч=1)или(Ч=3))и(Ь=Ложь)и(П2) Тогда Если ТС.Строки[ТС.Строки.Количество()-1].К1<>Ж Тогда Если НЕ((З="Балансовый")и(Г<>43)) Тогда С2=ТС.Строки.Добавить(); С2.К1=Ж; С2.К2=Ж; КонецЕсли; КонецЕсли; КонецЕсли; Если Ь Тогда Если НайтиПоФильтру(Н,ФД) Тогда Продолжить; КонецЕсли; КонецЕсли; 
					Если НЕ((П3)и(Ч<2)) Тогда
						Если Лев(М[0],3)="Доп" Тогда  
							Если Н="Открыть список" Тогда
								Если T Тогда
									#Если ТолстыйКлиентУправляемоеПриложение Тогда
										Попытка O(,Р).ПолучитьФормуСписка(); С2=ТС.Строки.Добавить(); С2.К1=Н; С2.К2="Открыть"; С2.Р2=1; С2.К5=С2.К2; Исключение КонецПопытки;
									#КонецЕсли
								Иначе С2=ТС.Строки.Добавить(); С2.К1=Н; С2.К2="Открыть"; С2.Р2=1;
								КонецЕсли;
							Иначе С2=ТС.Строки.Добавить(); С2.К1=Н;
								Если Н="Структура хранения" Тогда С2.К2="Открыть"; С2.Р2=1; С2.К3="Структура"; С2.К5=С2.К2;
								Иначе Х=МЗ(З,0); Х=?(Н="Подсистемы",Х,Х.Количество()); Если Х>0 Тогда С2.К2="Открыть"; С2.Р2=1; С2.К3="Доп"; С2.К5=С2.К2; КонецЕсли; 
								КонецЕсли;
							КонецЕсли;
						ИначеЕсли (Н="Справочная информация")или(Н="Права")или(Н="WS-ссылка") Тогда С2=ТС.Строки.Добавить(); С2.К1=Н; С2.К2="Открыть"; С2.Р2=1;  С2.К5=С2.К2;
						ИначеЕсли Н="Признак незаполненного родителя" Тогда С2=ТС.Строки.Добавить(); С2.К1=Н; С2.К2="Заданное значение";
						Иначе
							Если (ТО.Количество()>0)и(Лев(М[0],14)="Представление:") Тогда Для Каждого Х Из ТО Цикл Б=ПроходитПоТипу(Н,Х); Если Б=Ложь Тогда Прервать; КонецЕсли; КонецЦикла; Если ТО.Количество()>1 Тогда Если ((Н="Выбор групп и элементов")и(Б))или((Н="Форма выбора")и(Б=Ложь)) Тогда Б=?(Б,Ложь,Истина); КонецЕсли; КонецЕсли; Если Б Тогда Продолжить; КонецЕсли;
							Иначе Если ОтсутствиеЗначения(Н) Тогда Продолжить; КонецЕсли; 
							КонецЕсли; 
							Если (Н="Интерфейс")и(T) Тогда Продолжить; КонецЕсли; 
							Попытка П=О[T(З)]; С2=?((П1)или(Ь),ДР.Строки.Добавить(),ТС.Строки.Добавить()); С2.К1=Н; С2.К2=П; Т=ТипЗнч(П); С2.К4=П;
								Если Т=Тип("РасширенноеИмяXML") Тогда С2.К2=П.ЛокальноеИмя+" ("+П.URIПространстваИмен+")";
								ИначеЕсли Н="Значение незаполненного родителя" Тогда С2.К2=?(С2.К2="","<Не заполнено>",С2.К2);
								ИначеЕсли Т=Тип("СвязьПоТипу") Тогда С2.К2=П.ПутьКДанным;
								ИначеЕсли (С2.К1="Периодичность")и(К<>15) Тогда С2.К2=Периодичность(Строка(П)); 
								ИначеЕсли Н="Значение заполнения" Тогда Если ТО.Количество()>0 Тогда Если ТО[0]=5 Тогда С2.К2=?(Т=Тип("Неопределено"),"Ложь","Истина"); КонецЕсли; КонецЕсли; 
								Иначе
									Если С2.К1="Тип" Тогда
										Если ПустаяСтрока(П) Тогда ТО.Добавить(1); С2.К2="Произвольный"; С2.Р2=1; С2.К3=С2.К1; С2.К5=С2.К2; Продолжить;
										Иначе Для Каждого С Из П.Типы() Цикл Х=M(С); Т=T(Х,".",1); Б=H(?(Найти(Х,".")=0,T(Т," "),Т+"Ссылка"),5); Если Б=Неопределено Тогда ТО.Добавить(0); Иначе ТО.Добавить(Б.К1); КонецЕсли; КонецЦикла; 
										КонецЕсли;
									КонецЕсли; НаличиеСписков(С2,П,З); Ф=С2.К2;
									Если (Т=Тип("Дата"))и(П=Дата(1,1,1)) Тогда С2.К2="";
									Иначе
										Если (С2.К2=Строка(П))и(Найти(Ф," ")=0)и(Найти(Ф,".")=0) Тогда
											Если Найти(С2.К1,"Режим совместимости")>0 Тогда Я=СтрЗаменить(Ф,"Версия","Версия "); Я=СтрЗаменить(Я,"_",".");
											Иначе Я=Лев(Ф,1); Для Б=2 По СтрДлина(Ф) Цикл Х=Сред(Ф,Б,1); Ц=КодСимвола(Х); Я=Я+?((Ц>1039)и(Ц<1072)," "+Символ(Ц+32),Х); КонецЦикла;
											КонецЕсли; С2.К2=Я;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							Исключение
							КонецПопытки;
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли; 
			КонецЦикла;
			Если ((Г=32)и(Н="Ведущее"))или((Г=44)и(Найти(Р,".Перерасчеты.")>0)и(Н="Тип")) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если П1 или Ь Тогда ДР.Строки.Сортировать("К1"); КонецЕсли;
КонецПроцедуры
Функция ДобСтр(С)
	Возврат ?((ТипЗнч(С)=Тип("СтрокаДереваЗначений"))или(ТипЗнч(С)=Тип("ДеревоЗначений")),С.Строки.Добавить(),С.ПолучитьЭлементы().Добавить())		
КонецФункции
Функция ЗаполнитьСтроку(С,П)
	К=С.Р1; С1=ДобСтр(С); С1.Р1=?(К=14,71,К); С1.Р2=С1.Р1; С1.К1=?((К=57)или(К=58),П.Имя,П); С1.К2=П.Имя; С1.К3=С.К3+"."+?((К=3)и(Найти(С.К3,".")>0),"Подсистемы.","")+T(П.Имя); С1.К4=С.К4; С1.К5=Лев(П,5); С1.К6=Лев(П.Имя,5); Возврат С1;
КонецФункции
Процедура ОтобратьПодсистемы(С,Э,Ф)
	Если Ф=3 Тогда М=O(?(С.К3="Подсистемы",С.К3,С.К3+".Подсистемы")); Для Каждого П Из М Цикл С1=ЗаполнитьСтроку(С,П); С1.К7.Добавить("Просмотр"); Э1=ЗаполнитьСтроку(Э,П); Если П["Подсистемы"].Количество()>0 Тогда ОтобратьПодсистемы(С1,Э1,Ф); КонецЕсли; КонецЦикла;
	Иначе К=С.Строки.Количество();
		Для А=0 По К-1 Цикл
			П=С.Строки[?(Ф=2,А,К-1-А)]; Если Ф=2 Тогда С1=Э.Строки.Добавить(); С1.Р1=3; С1.К1=П.К1; С1.Р2=П.К4; ИначеЕсли Ф=4 Тогда П.К4=?(ПравоДоступа("Просмотр",O(П.К3),Э),1,0); Иначе З=O(П.К3).Состав.Содержит(Э); П.К4=?(З,1,0); КонецЕсли; 
			Если П.Строки.Количество()>0 Тогда ОтобратьПодсистемы(П,?(Ф=2,С1,Э),Ф); КонецЕсли; Если (П.Строки.Найти(1,"К4",Истина)=Неопределено)и(П.К4=0)и(Ф<>2) Тогда С.Строки.Удалить(П); КонецЕсли;	
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры
Процедура ЗаполнитьПраво(С,К)
	Если К<>51 Тогда О=B(К+3,1); Если О<>"" Тогда С.ЗагрузитьЗначения(T(О,"|")); КонецЕсли; КонецЕсли; 
КонецПроцедуры
Процедура ПроверкаЗаполнения(С,К)
	Д=H(К,1); З=T(Д.К2," "); Р=?(К<48,З,?(Найти(С.К3,".")=0,З,С.К3+"."+?(К=51,"ЗначенияПеречисления",З))); М=O(Р); А=?(К>9,Строка(К),"0"+К); 
	Если М<>"`" Тогда 
		Если ((К=53)и(С.Р1=56))или((К=49)и((С.Р1=32)или(С.Р1=60)))или(К=65)или(К=66)или(К=70) Тогда
			Для каждого П Из М Цикл
				С1=ДобСтр(С); С1.Р1=К; С1.Р2=К; С1.К1=П; С1.К2=П; С1.К3=Р+"."+П.Имя; С1.К4=С.К4; С1.К5=А; С1.К6=А; ЗаполнитьПраво(С1.К7,Д.К1); Если (К=65)и(M[10]=0) Тогда ПроверкаЗаполнения(С1,70); КонецЕсли; 
			КонецЦикла;
		Иначе Е=?(К=58,1,М.Количество());
			Если Е>0 Тогда
				С1=ДобСтр(С); С1.Р1=К; С1.Р2=К; С1.К1=?(К=31,Д.К3,Д.К2); С1.К2=С1.К1; С1.К3=T(Р," "); С1.К4=?(К<48,К,С.К4); С1.К5=А; С1.К6=А; ЗаполнитьПраво(С1.К7,Д.К1); С2=ДобСтр(С1); С2.К1="Х"; Если (К<>57)и(К<>58) Тогда Х=T(М[0].ПолноеИмя(),"."); Д.К3=?(Х.Количество()=2,Х[0],Х[2]); КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры
Процедура ЗаполнитьВВ(Д)
	В=Д.Строки.Количество()-1; P=0; Если Лев(ТекущийРежимЗапуска(),1)="О" Тогда PP.МаксимальноеЗначение=В; КонецЕсли; 
	Для А=0 По В Цикл
		С=Д.Строки[В-А];  P=P+1;
		Если С.Р1=2 Тогда ЗаполнитьВВ(С);
		Иначе	
			Если С.К7.Количество()=0 Тогда Д.Строки.Удалить(С);
			Иначе
				Если (С.Р1<>1)и(С.Строки.Количество()=1) Тогда
					Если С.Строки[0].К1="Х" Тогда
						С.Строки.Удалить(0); К=С.Р1; Если (К=33)и(С.Уровень()=0) Тогда ПроверкаЗаполнения(С,32); Если С.Строки.Количество()=1 Тогда С1=С.Строки[0]; С1.Строки.Удалить(С1.Строки[0]); Для Каждого П Из O(С1.К1) Цикл ЗаполнитьСтроку(С1,П); КонецЦикла; КонецЕсли; КонецЕсли;	
						Для Каждого П Из O(С.К1) Цикл
							С1=ЗаполнитьСтроку(С,П); Если (К=29)или((К<29)и((К<>8)и(К<>9)и(К<>23)и(К<>24))) Тогда Продолжить; КонецЕсли; С2=С1.Строки.Добавить(); С2.К1="Х"; 
						КонецЦикла; 
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла; 
	P=0;
КонецПроцедуры
Процедура ПроверитьНаличие(С,A="") Экспорт
	Если A<>"" Тогда M=ПолучитьИзВременногоХранилища(A); КонецЕсли; Если С.К3="Документы" Тогда Для А=31 По 32 Цикл ПроверкаЗаполнения(С,А); КонецЦикла; КонецЕсли; М=O(С.К3);
	Если ТипЗнч(М)=Тип("ОбъектМетаданных") Тогда Для А=48 По 69 Цикл Если ((А=57)или(А=58))и(M[10]=0) Тогда Продолжить; КонецЕсли; Если НаличиеРаздела(С.Р1,А) Тогда ПроверкаЗаполнения(С,А); КонецЕсли; КонецЦикла; 
	Иначе К=С.Р1; Ф=?(ТипЗнч(М)=Тип("ОписаниеСтандартнойТабличнойЧасти"),Истина,Ложь); P=0; Если A="" Тогда PP.МаксимальноеЗначение=?(К=58,2,М.Количество()+1); КонецЕсли; 
		Для Каждого П Из ?(Ф,М.СтандартныеРеквизиты,М) Цикл
			С1=ЗаполнитьСтроку(С,П); С1.Р1=?(Ф,57,С1.Р1); С1.К3=?(Ф,СтрЗаменить(С1.К3,П.Имя,"СтандартныеРеквизиты."+П.Имя),С1.К3); P=P+1; Если К=57 Тогда З=H(П.Имя,10); С1.К5=?(З=Неопределено,С1.К1,З.К1); С1.К6=С1.К5; КонецЕсли; Если (К=29)или(К=31)или((К<29)и(К<>8)и(К<>9)и(К<>15)и(К<>23)и(К<>24))или(Ф) Тогда Продолжить; КонецЕсли;
			Если (СтрЧислоВхождений(С.К3,".")=0)или(К=48)или(К=56)или(К=58)или(К=60)или(К=67)или(К=68) Тогда Если К>10 Тогда С2=ДобСтр(С1); С2.К1="Х"; С1.К7=?((К=56)или(К=58),С.К7,С1.К7); Иначе ПроверитьНаличие(С1); КонецЕсли; КонецЕсли; 
		КонецЦикла;
		P=0; Если (К=57)и(A="") Тогда С.Строки.Сортировать("К5"); КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
Функция ЗаполнитьСтрокуW(С,К,Н,Р)
	С1=С.Строки.Добавить(); С1.Р1=К; С1.Р2=К; С1.К1=Н; С1.К2=Н; С1.К3=Р; С1.К5=Н; С1.К6=Н; Возврат С1;
КонецФункции
Процедура ЗаполнитьЗначения(С,П)
	С1=ЗаполнитьСтрокуW(С,74,?(П.Имя="","Определение типа",П.Имя),?(П.Имя="",С.К3+".Тип","Получить("""+П.Имя+""")"));
	Если П.Фасеты<>Неопределено Тогда
		О=П.Фасеты.Образцы; Р=П.Фасеты.Перечисления; Если О<>Неопределено Тогда Для А=0 По О.Количество()-1 Цикл С2=ЗаполнитьСтрокуW(С1,76,О[А].Значение,С1.К3+".Фасеты.Образцы["+А+"]"); КонецЦикла; КонецЕсли; Если Р<>Неопределено Тогда Для А=0 По Р.Количество()-1 Цикл С2=ЗаполнитьСтрокуW(С1,77,Р[А].Значение,С1.К3+".Фасеты.Перечисления["+А+"]"); КонецЦикла; КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
Процедура ЗаполнитьОбъекты(С,П,Н)
	С1=ЗаполнитьСтрокуW(С,75,?(П.Имя="","Определение типа",П.Имя),?(П.Имя="",С.К3+".Тип","Получить("""+П.Имя+""")"));
	Для А=0 По П.Свойства.Количество()-1 Цикл
		Х=П.Свойства[А];
		Если Х.ТипВладелец=П Тогда
			С2=ЗаполнитьСтрокуW(С1,73,Х.Имя,С1.К3+".Свойства["+А+"]"); Если ТипЗнч(Х.Тип)=Тип("ТипЗначенияXDTO") Тогда Если Строка(Х.Тип)="" Тогда ЗаполнитьЗначения(С2,Х.Тип); КонецЕсли; Иначе Если Х.Тип.Имя="" Тогда Если Н="Пакет" Тогда ЗаполнитьОбъекты(С2,Х.Тип,Н); Иначе С2.К1="{"+Х.URIПространстваИмен+"}"+Х.Имя; КонецЕсли; КонецЕсли; КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
Процедура WSСылки(Д)
	Р=M[5].К3+".ПолучитьWSОпределения()"; С=ЗаполнитьСтрокуW(Д,25,"WS-ссылка",Р+".Документация"); З=O(,Р); Для Каждого Ф Из З.ФабрикаXDTO.Пакеты Цикл Если Ф.URIПространстваИмен=З.Сервисы[0].URIПространстваИмен Тогда С1=ЗаполнитьСтрокуW(С,79,"Модель данных",""); M[4]=Ф; Пакет(С1); КонецЕсли; КонецЦикла; 
	Для А=0 По З.Сервисы.Количество()-1 Цикл
		Если А=0 Тогда С2=ЗаполнитьСтрокуW(С,80,"Web-сервисы",Р); КонецЕсли; Х=З.Сервисы.Получить(А); С3=ЗаполнитьСтрокуW(С2,80,Х.Имя,С2.К3+".Сервисы["+А+"]"); 
		Для Б=0 По Х.ТочкиПодключения.Количество()-1 Цикл
			Т=Х.ТочкиПодключения.Получить(Б); С4=ЗаполнитьСтрокуW(С3,78,Т.Имя,С3.К3+".ТочкиПодключения["+Б+"]");
			Для В=0 По Т.Интерфейс.Операции.Количество()-1 Цикл
				О=Т.Интерфейс.Операции.Получить(В); С5=ЗаполнитьСтрокуW(С4,81,О.Имя,С4.К3+".Интерфейс.Операции["+В+"]"); Для Г=0 По О.Параметры.Количество()-1 Цикл П=О.Параметры.Получить(Г); С6=ЗаполнитьСтрокуW(С5,82,П.Имя,С5.К3+".Параметры["+Г+"]"); КонецЦикла; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры
Процедура Пакет(Д)
	Т=M[4]; О=Т.URIПространстваИмен; С=ЗаполнитьСтрокуW(Д,79,"Пакет ("+О+")",""); 
	Если Т.Зависимости.Количество()>1 Тогда С0=ЗаполнитьСтрокуW(С,72,"Директивы импорта",""); Для А=1 По Т.Зависимости.Количество()-1 Цикл Н=ЗаполнитьСтрокуW(С0,72,Т.Зависимости[А].URIПространстваИмен,""); КонецЦикла; КонецЕсли; 
	Если Т.КорневыеСвойства.Количество()>0 Тогда С1=ЗаполнитьСтрокуW(С,73,"Свойства",""); Для Каждого	П Из Т.КорневыеСвойства Цикл Н=ЗаполнитьСтрокуW(С1,73,П.Имя,"КорневыеСвойства.Получить("""+П.Имя+""")"); КонецЦикла; КонецЕсли; 
	С2=ЗаполнитьСтрокуW(С,74,"Типы значений",""); С3=ЗаполнитьСтрокуW(С,75,"Типы объектов",""); Для Каждого	П Из Т Цикл Если ТипЗнч(П)=Тип("ТипЗначенияXDTO") Тогда ЗаполнитьЗначения(С2,П); Иначе ЗаполнитьОбъекты(С3,П,M[6].К1); КонецЕсли; КонецЦикла;
	Если С2.Строки.Количество()=0 Тогда С.Строки.Удалить(С2); КонецЕсли; Если С3.Строки.Количество()=0 Тогда С.Строки.Удалить(С3); КонецЕсли;  
КонецПроцедуры
Процедура Стандарт(Д)
	Р=M[5].К3+"."+M[6].К3; О=O(Р); К=H(Строка(О),3).К1;
	Для Каждого П Из О Цикл
		Н=П.Имя; С=Д.Строки.Добавить(); С.Р1=К; С.Р2=К; С.К1=Н; С.К2=Н; С.К3=Р+"."+С.К2; З=H(Н,10); С.К5=?(З=Неопределено,Н,З.К1); С.К6=С.К5;
		Если К=58 Тогда
			Для Каждого Х Из П.СтандартныеРеквизиты Цикл
				Н=Х.Имя; С1=С.Строки.Добавить(); С1.Р1=57; С1.Р2=57; С1.К1=Н; С1.К2=Н; С1.К4=58; С1.К3=С.К3+".СтандартныеРеквизиты."+С1.К2; З=H(Н,10); С1.К5=?(З=Неопределено,Н,З.К1); С.К6=С.К5;
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла; Д.Строки.Сортировать("К5",Истина); 	
КонецПроцедуры
Процедура Роли(Д)
	Р=M[5].К3; К=M[5].Р1; Если К=6 Тогда Д=M[3].Скопировать(); ПроверитьРоли(O(Р),Д,0); Иначе М=МЗ(M[6].К1,1); З=T(B(К+3,1),"|"); Для Каждого П Из М Цикл С=Д.Строки.Добавить(); С.Р1=6; С.Р2=6; С.К1=П; С.К2=П.Имя; С.К3="Роли."+П.Имя; С.К5=П; С.К6=П.Имя; С.К7.ЗагрузитьЗначения(З); КонецЦикла; КонецЕсли; 
КонецПроцедуры
Процедура ПоляИндексы(С,Т,Ф)
	Если Т.Количество()>0 Тогда
		C1=ЗаполнитьСтрокуW(С,Ф+83,?(Ф=1,"Поля","Индексы"),"");
		Для Каждого П Из Т Цикл
			С2=ЗаполнитьСтрокуW(C1,Ф+83,П["Имя"+?(Ф=1,"Поля","Индекса")+"Хранения"]+?(Ф=1," ("+П.ИмяПоля+")",""),""); Для А=0 По П.Владелец().Колонки.Количество()-1 Цикл З=П.Получить(А); Если ТипЗнч(З)<>Тип("ТаблицаЗначений") Тогда С2.К7.Добавить(Строка(З),П.Владелец().Колонки[А].Имя); КонецЕсли; КонецЦикла; Если Ф=2 Тогда ПоляИндексы(С2,П.Поля,1); КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры
Процедура Структура(Д,Р)
	М=Новый Массив; М.Добавить(O(Р)); Т=ПолучитьСтруктуруХраненияБазыДанных(М);
	Для Каждого П Из Т Цикл
		С=ЗаполнитьСтрокуW(Д,83,П.ИмяТаблицыХранения+" ("+П.Назначение+" "+T(П.ИмяТаблицы,".",3)+")",""); Для А=0 По П.Владелец().Колонки.Количество()-1 Цикл З=П.Получить(А); Если ТипЗнч(З)<>Тип("ТаблицаЗначений") Тогда С.К7.Добавить(Строка(З),П.Владелец().Колонки[А].Имя); КонецЕсли; КонецЦикла; Для А=1 По 2 Цикл ПоляИндексы(С,?(А=1,П.Поля,П.Индексы),А); КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры
Процедура ПроверитьРоли(Р,Д,Ф)
	К=Д.Строки.Количество()-1; P=0; Если Лев(ТекущийРежимЗапуска(),1)="О" Тогда PP.МаксимальноеЗначение=К; P=0; КонецЕсли;	
	Для А=0 По К Цикл С=Д.Строки[К-А];  P=P+1;
		Если С.Р1=3 Тогда
			ОтобратьПодсистемы(С,Р,4); Если С.Строки.Количество()=0 Тогда Д.Строки.Удалить(С); КонецЕсли; 
		Иначе	
			Если Ф=0 Тогда
				Если С.Р1>1 Тогда Если С.Р1=2 Тогда ПроверитьРоли(Р,С,0); Иначе	ПроверитьРоли(Р,С,1); КонецЕсли; Если С.Строки.Количество()=0 Тогда Д.Строки.Удалить(С); КонецЕсли; КонецЕсли; 
			Иначе
				Если (С.Р1=32)и(С.Уровень()=1) Тогда ПроверитьРоли(Р,С,1); Если С.Строки.Количество()=0 Тогда С.Родитель.Строки.Удалить(С); КонецЕсли; Иначе Если НЕ ПравоДоступа(Д.К7[0],O(С.К3),Р) Тогда Д.Строки.Удалить(С); КонецЕсли; КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; P=0;
КонецПроцедуры
Процедура ОткрытьПрочие(Д,A="") Экспорт
	Если A<>"" Тогда M=ПолучитьИзВременногоХранилища(A); КонецЕсли; Н=M[6].К1; Д.Строки.Очистить(); 
	Если Н="Пакет" Тогда О=O(M[5].К3+".ПространствоИмен"); M[4]=ФабрикаXDTO.Пакеты.Получить(О); Пакет(Д);
	ИначеЕсли Н="Структура хранения" Тогда Структура(Д,M[5].К3);
	ИначеЕсли Н="WS-ссылка" Тогда WSСылки(Д);
	ИначеЕсли Н="Права" Тогда Если M[3].Строки.Найти("Перечисления","К1")<>Неопределено Тогда ЗаполнитьВВ(M[3]); КонецЕсли; Роли(Д); 
	Иначе Стандарт(Д);
	КонецЕсли;
КонецПроцедуры
Функция Подготовка(Д,Ф,A="") Экспорт
	Если A<>"" Тогда M=ПолучитьИзВременногоХранилища(A); КонецЕсли; Е=0; С=?(Ф[5],M[5],M[7]); К=С.Р1;
	Если Ф[5] Тогда Д.Строки.Очистить(); Ч=СтрЧислоВхождений(С.К3,"."); Если (Ч>0)или(К=1) Тогда З=H(С.К1,2); Э=?(З=Неопределено,К,З.К1); Если (З=Неопределено)или(К<>Э) Тогда М=T(С.К3,"."); ЗаполнитьД2(Д,?(К=1,"К",?(Ч<3,М[0],М[М.Количество()-2])),Ф); Е=1; КонецЕсли; КонецЕсли;
	Иначе Д.Строки.Очистить(); Если H(С.К1,2)=Неопределено Тогда ЗаполнитьД2(Д,?((К=57)и(M[6].К1<>"Права"),"СтандартныеРеквизиты",T(M[6].К1)),Ф); Е=1; КонецЕсли;	
	КонецЕсли; Возврат Е;	
КонецФункции
Функция ЗаполнитьНачало(Д) Экспорт
	M=Новый Массив(13); M[11]=0;
	Для А=1 По 4 Цикл Т=СТ(?(А=1,3,2)); К=1; Х=?(А=1,4,?(А=2,5,1));
		Для Б=1 По Х Цикл
			П=T(B(А,Б),";"); Для В=0 По П.Количество()-1 Цикл С=Т.Добавить(); С.К1=?(А=3,?(К>9,Строка(К),"0"+К),К); К=К+1; Если А=1 Тогда З=T(П[В],"~"); С.К2=З[0]; С.К3=?(З.Количество()>1,З[1],""); Иначе С.К2=П[В]; КонецЕсли; КонецЦикла;
		КонецЦикла; M[А-1]=Т;
	КонецЦикла; К=1;  
	Для А=1 По 2 Цикл М=T(B(1,А),";");
		Для Б=0 По М.Количество()-1 Цикл
			Если К<3 Тогда
				С1=Д.Строки.Добавить(); С1.Р1=К; С1.Р2=К; С1.К1=?(К=1,Метаданные.Синоним,"Общие"); С1.К2=?(К=1,Метаданные.Имя,"Общие"); С1.К4=К; К5=К; К6=К; Если К=1 Тогда С1.К7.ЗагрузитьЗначения(T(B(4,1),"|")); КонецЕсли;
			Иначе
				Если (К<>31)и(К<>32) Тогда ПроверкаЗаполнения(?(А=2,Д,С1),К); КонецЕсли;
				Если К=3 Тогда
					Если С1.Строки.Количество()=1 Тогда С2=С1.Строки[0]; С2.Строки.Удалить(С2.Строки[0]); Т=Д.Скопировать(); Т.Строки.Очистить(); Н=Т.Строки.Добавить(); Н.Р1=3; Н.К1=С2.К1; Н.К3=С2.К3; ОтобратьПодсистемы(С2,Н,3); M[12]=Т; КонецЕсли;
				КонецЕсли; 
			КонецЕсли; К=К+1;
		КонецЦикла;
	КонецЦикла; M[3]=Д.Скопировать(); Возврат M;
КонецФункции
Функция НайтиСтроку(М,Д)
	В=T(М[1],"~"); С2=Д.Строки.Найти(В[0],"К1",Истина); Р=T(М[0],"~",1); Если (С2<>Неопределено)и(В[1]=Строка(С2.Р1))и(С2.Родитель.К1=Р) Тогда С=С2; К=2; Иначе Возврат Неопределено; КонецЕсли; 
	Пока (С2<>Неопределено)и(В[1]=Строка(С2.Р1))и(С2.Родитель.К1=Р) Цикл
		С=С2; Р=С.К1; Если М.Количество()>К Тогда В=T(М[К],"~"); С2=С.Строки.Найти(В[0],"К1",Истина); К=К+1; Иначе Прервать; КонецЕсли; 
	КонецЦикла; Возврат С;
КонецФункции
Процедура ЗаполнитьВетку(С,М,К)
	Если ПустаяСтрока(С.К1) Тогда В=T(М[К],"~"); С.Р1=Число(В[1]); С.К1=В[0]; Иначе К=М.Найти(С.К1+"~"+С.Р1); КонецЕсли; Если М.Количество()>К+1 Тогда С1=С.Строки.Добавить(); ЗаполнитьВетку(С1,М,К+1); КонецЕсли; 
КонецПроцедуры
Функция ЗаполнитьСтроки(М)
	З=""; П=0;
	Для А=0 По М.Количество()-1 Цикл С=H(М[А],3); 
		Если С=Неопределено Тогда З=СтрЗаменить(З,"Нумераторы","НумераторыДокументов")+?(А=0,"",".")+М[А]; М[А]=Строка(O(З))+"~"+П;
		Иначе П=С.К1; Если (П>47)или(А=0) Тогда М[А]=С.К2+"~"+П; З=З+?(А=0,"",".")+T(С.К2); Иначе З=З+"."+?(С.К1=3,С.К2,М[А]); Если С.К1<>3 Тогда М[А]=Строка(O(З))+"~"+П; КонецЕсли; КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	Н=М.Найти("Реквизиты~53"); П=М.Найти("Подсистема"); Если (М.Найти("Табличные части~56")<>Неопределено)и(Н<>Неопределено) Тогда М.Удалить(Н); КонецЕсли; Если П<>Неопределено Тогда М.Удалить(П); КонецЕсли; Возврат М;
КонецФункции
Процедура ЗаполнитьПрочие(В,Д,A="") Экспорт
	Если A<>"" Тогда M=ПолучитьИзВременногоХранилища(A); КонецЕсли; О=O(M[5].К3+"."+M[6].К3); Если В<8 Тогда С=Д.Строки.Добавить(); С[?(A="","Р5","Р1")]=?(В=5,2,?(В=6,3,4))+?(A="",0,85); С.К5=?(В=5,"Счета",?(В=6,"Элементы","Характеристики")); КонецЕсли;
	Если В=7 Тогда
		Для Каждого П Из О Цикл
			З=O(,M[5].К3+"."+П); Н=С.Строки.Найти(З.Родитель.Код,"К6",Истина); С1=?(Н=Неопределено,С.Строки.Добавить(),Н.Строки.Добавить()); С1[?(A="","Р5","Р1")]=?(З.ЭтоГруппа,5,1)+?(A="",0,85); С1.К5=П; С1.К6=З.Код; С1.К7=З.Наименование; Т=З.ТипЗначения.Типы(); С1.К9=M[5].К3+"."+П+".ТипЗначения";
			Если A="" Тогда С1.Р8=1; КонецЕсли; Для Каждого Х Из Т Цикл Если Т.Количество()=1 Тогда С1.К8=M(Х); Иначе С1.К8="Открыть"; КонецЕсли; КонецЦикла;
		КонецЦикла;
	Иначе 
		Для Каждого П Из О Цикл
			Если В=20 Тогда С=Д.Строки.Добавить(); С.К1=П.Имя;
			ИначеЕсли В>9 Тогда С=Д.Строки.Добавить(); С.К5=П.Имя; Если В=11 Тогда С.К26=П.ПутьКДанным; С.К27=П.ИзменениеЗначения; Иначе С.К25=П.Значение; КонецЕсли;
			Иначе Если В<>9 Тогда З=O(,M[5].К3+"."+П); КонецЕсли; 
				Если В=5 Тогда Если З.Родитель.Код="" Тогда С1=С.Строки.Добавить(); Иначе Н=Д.Строки.Найти(З.Родитель.Код,"К6",Истина); С1=?(Н=Неопределено,С.Строки.Добавить(),Н.Строки.Добавить()); КонецЕсли; Иначе С1=?(В>7,Д.Строки.Добавить(),С.Строки.Добавить()); КонецЕсли; 
				Если В=9 Тогда Для А=17 По 24 Цикл Н=?(А=17,"ВидыХарактеристик",?(А=20,"ЗначениеОтбораВидов",?(А=21,"ЗначенияХарактеристик","Поле"+?(А=18,"Ключа",?(А=19,"ОтбораВидов",?(А=22,"Объекта",?(А=23,"Вида","Значения"))))))); О=П[Н]; С1["К"+А]=M(О); КонецЦикла; 
				Иначе
					С1[?(A="","Р5","Р1")]=?(В=8,2,1)+?(A="",0,85); С1.К5=П; С1.К6=З.Код; С1.К7=З.Наименование; Если В=5 Тогда С1.К9=З.Вид; С1.К10=З.Забалансовый; С1.К11=З.Порядок; С1.К13=З.Количественный; С1.К12=?(M[5].К2="Налоговый","",З.Валютный); Для А=0 По З.ВидыСубконто.Количество()-1 Цикл Выполнить("С1.К"+(А+14)+"=З.ВидыСубконто["+А+"].ВидСубконто"); КонецЦикла; КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
Процедура ЗаполнитьТипы(В,Ф,Д,A="") Экспорт
	Если A<>"" Тогда M=ПолучитьИзВременногоХранилища(A); КонецЕсли; Э1=H(1); Э2=H(3);
	Если Э2.К3="Доп" Тогда Н=Э2.К1; О=O(Э1.К3); М=МЗ(Н,1); З=H(Н,2); К=?(З=Неопределено,?(Н="Журналы",34,8),З.К1);
		Если Н="Подсистемы" Тогда ОтобратьПодсистемы(М,Д,2);
		Иначе
			Для Каждого П Из М Цикл
				С1=Д.Строки.Добавить(); С1.Р1=К; С1.К1=П; Если Н="Обмен данными" Тогда О=П.Состав.Найти(O(Э1.К3)); С1.К2=Строка(О.Авторегистрация); С1.Р2=?(С1.К2="Запретить",4,1); КонецЕсли; 
			КонецЦикла; 
		КонецЕсли;
	Иначе
		ТЗ=СТ(?(В=1,4,6)); О=O(?(Ф=0,?(Э1.К3="",Э2.К3,Э1.К3+"."+Э2.К3),""),?(Ф=0,"",M[9])); Т=ТипЗнч(О); О=?(Т=Тип("ОписаниеТипов"),О.Типы(),О); 
		Если В=20 Тогда Для Каждого П Из О Цикл С1=Д.Строки.Добавить(); С1.К1=П; КонецЦикла;
		Иначе
			Если Т=Тип("ОбъектМетаданных") Тогда Т1=ТЗ.Добавить(); Т1.К2=О; Т1.К1=T(M(О),".",1);
			Иначе
				Если (О.Количество()=0)и(Т=Тип("ОписаниеТипов")) Тогда Т1=ТЗ.Добавить(); Т1.К1="Произвольный"; Т1.К2="Произвольный";
				Иначе
					Для Каждого П Из О Цикл
						Если В=3 Тогда Если Строка(П.Использование)="Авто" Тогда Продолжить; КонецЕсли; КонецЕсли; Если ТипЗнч(П)=Тип("ЭлементСоставаФункциональнойОпции") Тогда Если П.Объект=Неопределено Тогда Продолжить; КонецЕсли; КонецЕсли; Т1=ТЗ.Добавить(); М=T(M(П),"."); 
						Если М.Количество()=1 Тогда Т1.К1=T(П," "); Т1.К2=П;
						Иначе Если В=1 Тогда Н=Найти(П,":"); Т1.К1=М[0]; Т1.К4=?(Н=0,М[0]+"Ссылка",T(T(П,":",1)," ")); Т1.К2=?(Н=0,П,P(П)); Иначе Т1.К1=М[0]; Т1.К2=P(П); КонецЕсли;	
						КонецЕсли; 
						Если В=3 Тогда Т1.К5=Строка(П.Использование); Т1.К6=Строка(П.УсловноеРазделение); ИначеЕсли В=4 Тогда Т1.К5=Строка(П.Авторегистрация); КонецЕсли;
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли; ТН=ТЗ.Скопировать(); ТН.Свернуть("К1,К3,К4");
			Для Каждого П Из ТН Цикл
				Ф=?(В=1,H(?(Найти(П.К4,"Ссылка")=0,П.К1,П.К4),5),H(П.К1,3)); Если Ф=Неопределено Тогда П.К3=0; Иначе П.К3=Ф.К1; Если В>1 Тогда П.К4=Ф.К2; КонецЕсли; КонецЕсли;
			КонецЦикла; ТН.Сортировать("К3"); ОБ=0; ДК=0; 
			Для Каждого П Из ТН Цикл К=П.К3; НЗ=ТЗ.Скопировать(Новый Структура("К1",П.К1));
				Если В=1 Тогда Если (К>17)и(К<53)и(К<>29) Тогда С0=Д.Строки.Добавить(); С0.Р1=П.К3; С0.К1=?(ЗначениеЗаполнено(П.К4),П.К4,П.К1); КонецЕсли; Для Каждого Т Из НЗ Цикл С2=?((К>17)и(К<53)и(К<>29),С0.Строки.Добавить(),Д.Строки.Добавить()); С2.Р1=К; С2.К1=Т.К2; КонецЦикла;
				Иначе Если ((К<29)и(ОБ=0))или((К>30)и(К<34)и(ДК=0)) Тогда С0=Д.Строки.Добавить(); С0.К1=?(К<29,"Общие","Документы"); С0.Р1=?(К<29,2,33); Если К<29 Тогда ОБ=1; Иначе ДК=1; КонецЕсли; КонецЕсли; Если (К<>33)и(К<48) Тогда С1=?((К<29)или(К=31)или(К=32),С0.Строки.Добавить(),Д.Строки.Добавить()); С1.Р1=К; С1.К1=П.К4; КонецЕсли; 
					Для Каждого Т Из НЗ Цикл
						Если ТипЗнч(Т.К2)=Тип("ОбъектМетаданных") Тогда М=ЗаполнитьСтроки(T(Т.К2.ПолноеИмя(),".")); С2=НайтиСтроку(М,Д); Если С2=Неопределено Тогда С2=?(К>47,Д.Строки.Добавить(),?(К=33,С0.Строки.Добавить(),С1.Строки.Добавить())); КонецЕсли; 
							Если М.Количество()=2 Тогда С2.Р1=К; С2.К1=Т.К2; Если В=3 Тогда С2.К3=?(Т.К5="НеИспользовать","Не использовать",Т.К5); С2[?(A="","Р3","Р2")]=?(Т.К5="Использовать",1,2); С2.К4=Т.К6; ИначеЕсли В=4 Тогда С2.К2=Т.К5; С2.Р2=?(Т.К5="Запретить",4,1); КонецЕсли; 
							Иначе ЗаполнитьВетку(С2,М,1);
							КонецЕсли; 
						Иначе С2=?(К>47,Д.Строки.Добавить(),?(К=33,С0.Строки.Добавить(),С1.Строки.Добавить())); С2.Р1=К; С2.К1=Т.К2;
						КонецЕсли;
					КонецЦикла; 
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура Печать(Д,Т) Экспорт
	М=ПолучитьМакет("Макет"); О=М.ПолучитьОбласть("Ш"); Т.Вывести(О);
	Для Каждого С Из Д.Строки Цикл
		О=М.ПолучитьОбласть("Т"); П=С.К7; Для А=0 По П.Количество()-1 Цикл О.Параметры["К"+А]=П[А].Значение; КонецЦикла; Т.Вывести(О); Т.НачатьГруппуСтрок("Т",Истина);
		Для Каждого С1 Из С.Строки Цикл 
			О=М.ПолучитьОбласть("Н"); О.Параметры["Н"]=С1.К1+" таблицы"; Т.Вывести(О); 
			Для Каждого С2 Из С1.Строки Цикл
				О=М.ПолучитьОбласть(?(С1.К1="Поля","С","И")); П=С2.К7; Для А=0 По П.Количество()-1 Цикл О.Параметры["К"+А]=П[А].Значение; КонецЦикла; Т.Вывести(О);
				Если С1.К1="Индексы" Тогда
					Для Каждого С3 Из С2.Строки Цикл
						О=М.ПолучитьОбласть("Р"); Т.Вывести(О); Для Каждого С4 Из С3.Строки Цикл О=М.ПолучитьОбласть("К"); П=С4.К7; Для А=0 По П.Количество()-1 Цикл О.Параметры["К"+А]=П[А].Значение; КонецЦикла; Т.Вывести(О); КонецЦикла; 
					КонецЦикла; 
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; Т.ЗакончитьГруппуСтрок();
	КонецЦикла;	О=М.ПолучитьОбласть("Х"); Т.Вывести(О); Т.АвтоМасштаб=Истина;
КонецПроцедуры
