
Перем мДекоратор;

#Область _// ПРЕДОПРЕДЕЛЕННЫЕ МЕТОДЫ

Функция ПолучитьСписокТестов(Браузер) Экспорт
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьРеквизитныйСоставДокументаСПроведением");

	Возврат ВсеТесты;
КонецФункции

Процедура Инициализация(БраузерОбъект) Экспорт
	
	мДекоратор = БраузерОбъект.ПолучитьКонтекст("Декоратор");
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	Возврат Ложь;
КонецФункции



Процедура ПередЗапускомНабораТестов() Экспорт
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
	НачатьТранзакцию();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗапускаНабораТестов() Экспорт
КонецПроцедуры
	
#КонецОбласти



#Область _// ТЕСТЫ

Процедура ТестДолжен_ПроверитьРеквизитныйСоставДокументаСПроведением() Экспорт
	
	ШаблонТестирования = мДекоратор.ПолучитьШаблонТестирования("xddШТ_ПроверкаРеквизитногоСоставаДокументаСПроведением");
	Макет = ПолучитьМакет("Проведение_Документ1_ТабличнаяЧасть1_РегистрНакопления1");
	ШаблонТестирования.ВыполнитьПроверку(Макет);
	
КонецПроцедуры
	
	
#КонецОбласти

